minimax_bench/results/mxfp4_tp4_conc32_bench.log
[aiter] import [module_aiter_enum] under /app/aiter-test/aiter/jit/module_aiter_enum.so
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(backend='vllm', base_url='http://localhost:8002', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='amd/MiniMax-M2.5-MXFP4', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=320, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/root/learn-kernels/minimax_bench/results', result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=512, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=1)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6564  max=8187  mean=7350.19  avg_token_mismatch=0.00  
 output_lens: min=409   max=511   mean=462.19  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 1 requests...
100%|██████████| 1/1 [00:05<00:00,  5.87s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 320/320 [01:54<00:00,  2.78it/s]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     320       
Benchmark duration (s):                  114.91    
Total input tokens:                      2352062   
Total generated tokens:                  147900    
Request throughput (req/s):              2.78      
Output token throughput (tok/s):         1287.08   
Total Token throughput (tok/s):          21755.50  
---------------Time to First Token----------------
Mean TTFT (ms):                          490.23    
Median TTFT (ms):                        223.45    
P99 TTFT (ms):                           3998.82   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.05     
Median TPOT (ms):                        23.53     
P99 TPOT (ms):                           26.64     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.04     
Median ITL (ms):                         14.37     
P99 ITL (ms):                            247.62    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11138.90  
Median E2EL (ms):                        11231.22  
P99 E2EL (ms):                           15149.20  
==================================================