minimax_bench/results/tp2_conc16_bench.log
Namespace(backend='vllm', base_url='http://localhost:8002', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=16, model='MiniMaxAI/MiniMax-M2.5', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=160, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='minimax_bench/results', result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=512, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=1)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6564  max=8187  mean=7343.95  avg_token_mismatch=0.00  
 output_lens: min=409   max=512   mean=457.42  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 1 requests...
100%|██████████| 1/1 [00:06<00:00,  6.29s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 160/160 [02:00<00:00,  1.33it/s]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     160       
Benchmark duration (s):                  120.27    
Total input tokens:                      1175032   
Total generated tokens:                  73187     
Request throughput (req/s):              1.33      
Output token throughput (tok/s):         608.52    
Total Token throughput (tok/s):          10378.46  
---------------Time to First Token----------------
Mean TTFT (ms):                          552.23    
Median TTFT (ms):                        319.68    
P99 TTFT (ms):                           3531.54   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.77     
Median TPOT (ms):                        25.25     
P99 TPOT (ms):                           28.15     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.76     
Median ITL (ms):                         17.51     
P99 ITL (ms):                            244.24    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11878.07  
Median E2EL (ms):                        11799.01  
P99 E2EL (ms):                           15507.65  
==================================================